Autodesk.Navisworks.Api.Transaction
This is used to batch together edits.
Currently it is a requirement that you must call Commit,
after doing your edits. In the future rollback may be supported.

Autodesk.Navisworks.Api.Transaction.#ctor(Autodesk.Navisworks.Api.Document,System.String)
This is used to batch together edits. In C# it would typically be used
within a 'using' block.In the future it may support rollback.
document:
The Document that this transaction applies to.
displayName:
String that may be displayed in the GUI for undoing this transaction.

Autodesk.Navisworks.Api.Transaction.Commit
Call to commit the transaction.
Throws System.InvalidOperationException:
Transaction has already been Commited
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transaction.DisplayName
String that may be displayed in the GUI for undoing this transaction.

Autodesk.Navisworks.Api.Transaction.Dispose


Autodesk.Navisworks.Api.Transaction.Document
The Document that this transaction applies to.

Autodesk.Navisworks.Api.Transaction.IsCommitted
Has this transaction been committed ?

Autodesk.Navisworks.Api.Transaction.IsDisposed
Has this transaction been disposed ?